<template>
  <section>
    <b-collapse
        class="card"
        animation="slide"
        v-for="(rab, index) of rabs"
        :key="index"
        :open="showAll?true:rab.isOpen">
        <div
            slot="trigger"
            slot-scope="props"
            class="card-header"
            role="button" :class="props.open?'title-open':''">
            <div class="is-size-6 has-text-weight-bold p-5" v-html="w(rab.title)"/>

            <a class="card-header-icon" v-if="rab.sub.length>0">
                <b-icon
                    :icon="props.open ? 'menu-down' : 'menu-up'">
                </b-icon>
            </a>
        </div>
        <div class="card-content" v-if="rab.sub.length>0">
            <div class="content">
                <div class="subitem"
                    v-for="(rabsub, sindex) of rab.sub"
                    :key="sindex">
                    <div v-html="w(rabsub.title)"/>

                    <div class="subitem2 is-size-7"
                        v-for="(rabsub2, sindex2) of rabsub.sub2"
                        :key="sindex2">
                        <div v-html="w(rabsub2)"/>
                    </div>

                </div>
            </div>
        </div>
    </b-collapse>
  </section>
</template>

<script>
import { w } from "../modules/theme.ts";

export default {
  props:{
    showAll: {type:Boolean,default:false},
  },    

methods:{
    w: function(text){
      return w(text);
    }, 
},    
  data() {
    return {
      rabs: [
        {
          id: "rab1",
          isOpen: false,
          title:
            "Технологическое проектирование объектов газовой и нефтяной промышленности: промысловые сооружения, связанные с обустройством газовых и нефтегазоконденсатных месторождений",
          sub: [
            {
              title:
                "обвязка газовых и нефтяных скважин, кустов скважин, прискважинные сооружения",
            },
            {
              title:
                "газо- и нефтепроводы-шлейфы от скважин и кустов скважин до площадок сбора и подготовки углеводородов",
            },
            {
              title:
                "установки комплексной и предварительной подготовки газа, нефти, включая",
              sub2: [
                "узлы входа шлейфов, пробкоуловители",
                "сепарационные установки",
                "установки осушки газа (низкотемпературная сепарация, низкотемпературна абсорбция, адсорбция, абсорбция и др.)",
                "установки охлаждения газа (аппараты воздушного охлаждения, парокомпрессионные, с турбодетандерами)",
                "установки регенерации реагентов (абсорбенты, ингибиторы)",
                "установки стабилизации и фракционирования конденсата, в т. ч. с получением кондиционных моторных топлив",
                "дожимные и утилизационные компрессорные станции",
                "головные и магистральные насосные станции стабильного и нестабильного конденсата, нефти",
                "установки обезвоживания и обессоливания нефти",
              ],
            },
            {
              title:
                "магистральные и межплощадочные газо-, нефте- и конденсатопроводы",
            },
            {
              title: "компрессорные станции магистральных трубопроводов",
            },
            {
              title:
                "подземные хранилища газа, нефти, газового конденсата и продуктов их переработки",
            },
            {
              title:
                "заводы и отдельные установки по переработке природного газа, нефти, газового конденсата и сопутствующих продуктов, в т. ч. для газов с высоким содержанием кислых компонентов (H2S, CO2), включая установки регенерации реагентов, фракционирования, переработки фракций углеводородов с получением кондиционных товарных продуктов, газовой серы, резервуарные парки и склады товарной продукции и др.",
            },
            {
              title:
                "гелиевые заводы с получением жидкого и газообразного гелия",
            },
            {
              title: "заводы и резервуарные парки сжиженного природного газа",
            },
            {
              title:
                "объекты снабжения газовым топливом с давлением до 1,2 МПа предприятий и населенных пунктов",
            },
            {
              title:
                "автомобильные заправочные станции с использованием сжиженных, сжатых углеводородных газов и нефтепродуктов в качестве моторного топлива",
            },
          ],
        },
        {
          id: "rab2",
          isOpen: false,
          title: "Разработка градостроительной документации",
          sub: [
            {
              title: "подготовка генерального плана земельного участка",
            },
            {
              title:
                "подготовка схемы планировочной организации трассы линейного объекта",
            },
            {
              title:
                "подготовка схемы планировочной организации полосы отвода линейного сооружения",
            },
          ],
        },
        {
          id: "rab3",
          isOpen: false,
          title: "Архитектурное проектирование",
          sub: [
            {
              title:
                "проектирование промышленных, жилых, общественных зданий, включая фундаменты и основания, стены, перекрытия, кровли, фассады и др.",
            },
          ],
        },
        {
          id: "rab4",
          isOpen: false,
          title: "Строительное проектирование",
          sub: [
            {
              title:
                "проектирование строительных конструкций из металла, бетона, железобетона и др.",
            },
          ],
        },
        {
          id: "rab5",
          isOpen: false,
          title: "Проектирование инженерных сетей и систем",
          sub: [
            { title: "отопление, вентиляция, кондиционирование" },
            { title: "водоснабжение, канализация" },
            { title: "тепло и газоснабжение" },
            { title: "холодоснабжение" },
            {
              title:
                "электроснабжение до 35 кВ, электрические освещение и отопление",
            },
            { title: "автоматизация и КИП" },
            { title: "связь, радио, телевидение" },
            { title: "механизация и транспорт (внешний и внутриплощадочный)" },
          ],
        },
        {
          id: "rab6",
          isOpen: false,
          title: "Разработка специальных разделов проектов",
          sub: [
            { title: "охрана окружающей среды" },
            { title: "защита строительных конструкций от коррозии" },
            { title: "инженерно-технические мероприятия гражданской обороны" },
            { title: "управление производством и предприятием" },
            { title: "организация строительства" },
            { title: "сметная документация" },
          ],
        },
        {
          id: "rab7",
          isOpen: false,
          title: "Проектный инжиниринг",
          sub: [
            {
              title:
                "разработка инвестиционных намерений и технико-экономических обоснований на строительство",
            },
            {
              title:
                "получение и оформление исходных данных для проектирования",
            },
            {
              title:
                "техническое сопровождение проектов и авторский надзор за строительством",
            },
          ],
        },
        {
          id: "rab8",
          isOpen: false,
          title:
            "Инженерно-геодезические, инженерно-геологические, инженерно-гидрометеорологические, инженерно-экологические изыскания, в т. ч. в районах с наличием многолетнемерзлых грунтов",
          sub: [],
        },
      ],
    };
  },
}
</script>

<style lang="scss" scoped>
@import "../modules/theme.scss";
.title-open{
    background: $color6-4;
}
.subitem{
    padding: 10px;
    padding-left: 50px;
}
.subitem2{
    padding: 3px;
    padding-left: 50px;
}
</style>